2-CaseFiles/case11/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    In1
    {
        type            fixedValue;
        value           uniform (0.01 0 0);
    }

    In2
    {
        type            fixedValue;
        value           uniform (-0.01 0 0);
    }

    Out1
    {
        type            zeroGradient;
    }

    Out2
    {
        type            zeroGradient;
    }

    TBWall
    {
        type            slip;
    }

    LatWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}


// ************************************************************************* //
