2-CaseFiles/case11/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    In1
    {
        type            zeroGradient;
    }

    In2
    {
        type            zeroGradient;
    }

    Out1
    {
        type            fixedValue;
        value           uniform 0;
    }

    Out2
    {
        type            fixedValue;
        value           uniform 0;
    }

    TBWall
    {
        type            zeroGradient;
    }

    LatWall
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
